demonstracoes/c#/DemonstracaoGNRE C Sharp/bin/Debug/Templates/ConsultaConfigUF.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:gnr="http://www.gnre.pe.gov.br/webservice/GnreConfigUF">
<soap:Header>
<gnr:gnreCabecMsg>
<gnr:versaoDados>1.00</gnr:versaoDados>
</gnr:gnreCabecMsg>
</soap:Header>
<soap:Body>
<gnr:gnreDadosMsg>
<TConsultaConfigUf xmlns="http://www.gnre.pe.gov.br"><ambiente>%s</ambiente><uf>%s</uf></TConsultaConfigUf>
</gnr:gnreDadosMsg>
</soap:Body>
</soap:Envelope>